app/views/addcourses/new.html.erb

    <%= label :addcourse, :course, 'Course', :class => 'col-form-label' %>
    <%= collection_select :addcourse, :course, Course.all, :course, :course, prompt: true, :class => 'form-control' %>
---
SELECT "courses".* FROM "courses"