app/views/addcourses/new.html.erb

SELECT "courses".* FROM "courses"
---
            <%= label :addcourse, :course, 'Course', :class => 'col-form-label' %>
            <%= collection_select :addcourse, :course, Course.all, :course, :course, options = {:prompt => 'Select a Class...'}, html_options = {class: 'form-control col-1'} %>