app/controllers/addcourses_controller.rb

    def show
      @uni = session[:uni]

      @thetakencourses = Addcourse.where(uni: @uni)
      @taken_courses = []
      @thetakencourses.each do |tc|
        @taken_courses << tc.course
      end

      unfiltered_courses = Course.search(params[:search])
      @courses = []
      unfiltered_courses.each do |unf_c|
        if not @taken_courses.include? unf_c.course
---
SELECT "addcourses".* FROM "addcourses" WHERE "addcourses"."uni" = $1  [["uni", "rn142"]]
SELECT "courses".* FROM "courses" WHERE (course LIKE '%COMS%')
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 233], ["LIMIT", 1]]

    def create
      @addcourse  = Addcourse.create!(uni: session[:uni],
                                      course: addcourse_params[:course],
                                      semester: addcourse_params[:semester],
                                      year: addcourse_params[:year])
---
INSERT INTO "addcourses" ("uni", "course", "semester", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["uni", ""], ["course", "COMS 4152 Engineering SaaS"], ["semester", nil], ["year", nil], ["created_at", "2022-12-18 03:00:30.858734"], ["updated_at", "2022-12-18 03:00:30.858734"]]

    def update
      id = params[:id]
      @course = Course.find(id)
      @uni = session[:uni]
      @addcourse  = Addcourse.create!(uni: @uni,
                                      course: @course.course)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 249], ["LIMIT", 1]]
INSERT INTO "addcourses" ("uni", "course", "semester", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"