app/controllers/courses_controller.rb

    def show
      #show a specific class
      id = params[:id]
      @course = Course.find(id)

      found_reviews = Coursereview.where(course: @course.course, prof: @course.prof)
      @reviews = []
      found_reviews.each do |fr|
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "coursereviews".* FROM "coursereviews" WHERE "coursereviews"."course" = $1 AND "coursereviews"."prof" = $2  [["course", "COMS 3157 Advanced Programming"], ["prof", "Jae Woo Lee"]]