app/controllers/dashboards_controller.rb

SELECT "addcourses".* FROM "addcourses" WHERE "addcourses"."uni" = $1  [["uni", "ss6167"]]
SELECT "schoolreqs".* FROM "schoolreqs" WHERE "schoolreqs"."school" = $1  [["school", "CC"]]
---
    def show
      @courses = Course.search(params[:search])
      #puts @uni
      #puts "uni above ^^^"
      @uni = session[:uni]
      @user = User.find_by(uni: @uni)

      @thetakencourses = Addcourse.where(uni: @uni)
      @taken_courses = []
      @thetakencourses.each do |tc|
        @taken_courses << tc.course
      end

      if @user
        @theschoolreqs = Schoolreq.search(@user.school)
        @school_reqs = []
        @theschoolreqs.each do |sr|
          if not @taken_courses.include? sr.course
            @school_reqs << Course.find_by(course: sr.course)
          end
        end

        @theminorreqs = Minorreq.search(@user.minor)
        @minor_reqs = []
        @theminorreqs.each do |mnr|
          if not @taken_courses.include? mnr.course
            @minor_reqs << Course.find_by(course: mnr.course)
          end
        end

        @themajorreqs = Majorreq.search(@user.major)