app/controllers/dashboards_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uni" = $1 LIMIT $2  [["uni", "ss6167"], ["LIMIT", 1]]
SELECT "studentschedules".* FROM "studentschedules" WHERE "studentschedules"."uni" = $1  [["uni", "ss6167"]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "COMS 3203 Discrete Math"], ["LIMIT", 1]]
---
    def show
      #puts @uni
      #puts "uni above ^^^"
      @uni = session[:uni]
      @user = User.find_by(uni: @uni)

      found_courses = Studentschedule.where(uni: @uni)
      @schedule = [[], [], [], [], []] # Monday Tuesday Wednesday Thursday Friday
      found_courses.each do |fc|
        thecourse = Course.find_by(course: fc.course)

SELECT "addcourses".* FROM "addcourses" WHERE "addcourses"."uni" = $1  [["uni", "ss6167"]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "COMS 3157 Advanced Programming"], ["LIMIT", 1]]
---

      end

      @thetakencourses = Addcourse.where(uni: @uni)
      @taken_courses = []
      @thetakencourses.each do |tc|

SELECT "studentschedules".* FROM "studentschedules" WHERE "studentschedules"."uni" = $1  [["uni", "ss6167"]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "ENGI E1102 The Art of Engineering"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE (course LIKE '%COMS%')
---

      @theaddedcourses = Studentschedule.where(uni: @uni)
      @added_courses = []
      @theaddedcourses.each do |ac|
        @added_courses << ac.course
      end

      unfiltered_courses = Course.search(params[:search])
      @courses = []
      unfiltered_courses.each do |unf_c|
        if not @taken_courses.include? unf_c.course and not @added_courses.include? unf_c.course

SELECT "schoolreqs".* FROM "schoolreqs" WHERE "schoolreqs"."school" = $1  [["school", "SEAS"]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "ENGI E1102 The Art of Engineering"], ["LIMIT", 1]]
---
      end

      if @user
        @theschoolreqs = Schoolreq.search(@user.school)
        @school_reqs = []
        @theschoolreqs.each do |sr|
          if not @taken_courses.include? sr.course and not @added_courses.include? sr.course
            @school_reqs << Course.find_by(course: sr.course)

SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "CC1010 University Writing"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "IEOR E3658 Probability for Engineers"], ["LIMIT", 1]]
---
        @theminorreqs = Minorreq.search(@user.minor)
        @minor_reqs = []
        @theminorreqs.each do |mnr|
          if not @taken_courses.include? mnr.course and not @added_courses.include? mnr.course
            @minor_reqs << Course.find_by(course: mnr.course)

SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "IEOR E3658 Probability for Engineers"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."course" = $1 LIMIT $2  [["course", "COMS 3203 Discrete Math"], ["LIMIT", 1]]
---
        @themajorreqs = Majorreq.search(@user.major)
        @major_reqs = []
        @themajorreqs.each do |mjr|
          if not @taken_courses.include? mjr.course and not @added_courses.include? mjr.course
            @major_reqs << Course.find_by(course: mjr.course)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
DELETE FROM "studentschedules" WHERE "studentschedules"."id" = $1  [["id", 14]]
SELECT "studentschedules".* FROM "studentschedules" WHERE "studentschedules"."uni" = $1 AND "studentschedules"."course" = $2  [["uni", "ss6167"], ["course", "HUMA UN1121 Masterpieces of Western Art"]]
INSERT INTO "studentschedules" ("uni", "course", "created_at", "updated_at", "time") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["uni", "ss6167"], ["course", "HUMA UN1121 Masterpieces of Western Art"], ["created_at", "2022-12-05 22:14:57.333906"], ["updated_at", "2022-12-05 22:14:57.333906"], ["time", nil]]
---
    def update
      id = params[:id]
      @course = Course.find(id)
      @uni = session[:uni]
      if params[:remove_from_schedule]
        Studentschedule.where(uni: @uni, course: @course.course).destroy_all
      else
        schedule_course = Studentschedule.create!(uni: @uni, course: @course.course)