app/controllers/users_controller.rb

    def show
      if params[:uni]
        @past_user = User.find_by(uni: params[:uni])
---
SELECT "users".* FROM "users" WHERE "users"."uni" = $1 LIMIT $2  [["uni", "ss6167"], ["LIMIT", 1]]

    def create
      #@users = User.create!(user_params)
      #@user = User.find params[:id]
      #flash[:notice] = "#{@user} was successfully created."

      prev_user = User.find_by(uni: user_params["uni"])
      if prev_user
        user_id = prev_user.id
        User.delete(user_id)
      end

      @user  = User.create!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."uni" = $1 LIMIT $2  [["uni", "ss6167"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 44]]
INSERT INTO "users" ("first", "last", "year", "school", "major", "minor", "uni", "created_at", "updated_at", "password") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"